{"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 150, 150, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_12"}, "name": "input_12", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "efficientnetv2-l", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 150, 150, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_11"}, "name": "input_11", "inbound_nodes": []}, {"class_name": "Rescaling", "config": {"name": "rescaling_2", "trainable": false, "dtype": "float32", "scale": 0.0078125, "offset": -1}, "name": "rescaling_2", "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stem_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_conv", "inbound_nodes": [[["rescaling_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_bn", "inbound_nodes": [[["stem_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stem_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "stem_activation", "inbound_nodes": [[["stem_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_project_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_project_conv", "inbound_nodes": [[["stem_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1a_project_bn", "inbound_nodes": [[["block1a_project_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1a_project_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block1a_project_activation", "inbound_nodes": [[["block1a_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block1a_add", "trainable": false, "dtype": "float32"}, "name": "block1a_add", "inbound_nodes": [[["block1a_project_activation", 0, 0, {}], ["stem_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1b_project_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1b_project_conv", "inbound_nodes": [[["block1a_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1b_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1b_project_bn", "inbound_nodes": [[["block1b_project_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1b_project_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block1b_project_activation", "inbound_nodes": [[["block1b_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block1b_add", "trainable": false, "dtype": "float32"}, "name": "block1b_add", "inbound_nodes": [[["block1b_project_activation", 0, 0, {}], ["block1a_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1c_project_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1c_project_conv", "inbound_nodes": [[["block1b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1c_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1c_project_bn", "inbound_nodes": [[["block1c_project_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1c_project_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block1c_project_activation", "inbound_nodes": [[["block1c_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block1c_add", "trainable": false, "dtype": "float32"}, "name": "block1c_add", "inbound_nodes": [[["block1c_project_activation", 0, 0, {}], ["block1b_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1d_project_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1d_project_conv", "inbound_nodes": [[["block1c_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1d_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1d_project_bn", "inbound_nodes": [[["block1d_project_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1d_project_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block1d_project_activation", "inbound_nodes": [[["block1d_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block1d_add", "trainable": false, "dtype": "float32"}, "name": "block1d_add", "inbound_nodes": [[["block1d_project_activation", 0, 0, {}], ["block1c_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_expand_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_expand_conv", "inbound_nodes": [[["block1d_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_expand_bn", "inbound_nodes": [[["block2a_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2a_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2a_expand_activation", "inbound_nodes": [[["block2a_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_project_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_project_conv", "inbound_nodes": [[["block2a_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_project_bn", "inbound_nodes": [[["block2a_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_expand_conv", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_expand_conv", "inbound_nodes": [[["block2a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_expand_bn", "inbound_nodes": [[["block2b_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2b_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2b_expand_activation", "inbound_nodes": [[["block2b_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_project_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_project_conv", "inbound_nodes": [[["block2b_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_project_bn", "inbound_nodes": [[["block2b_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2b_add", "trainable": false, "dtype": "float32"}, "name": "block2b_add", "inbound_nodes": [[["block2b_project_bn", 0, 0, {}], ["block2a_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2c_expand_conv", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2c_expand_conv", "inbound_nodes": [[["block2b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2c_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2c_expand_bn", "inbound_nodes": [[["block2c_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2c_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2c_expand_activation", "inbound_nodes": [[["block2c_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2c_project_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2c_project_conv", "inbound_nodes": [[["block2c_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2c_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2c_project_bn", "inbound_nodes": [[["block2c_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2c_add", "trainable": false, "dtype": "float32"}, "name": "block2c_add", "inbound_nodes": [[["block2c_project_bn", 0, 0, {}], ["block2b_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2d_expand_conv", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2d_expand_conv", "inbound_nodes": [[["block2c_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2d_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2d_expand_bn", "inbound_nodes": [[["block2d_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2d_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2d_expand_activation", "inbound_nodes": [[["block2d_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2d_project_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2d_project_conv", "inbound_nodes": [[["block2d_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2d_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2d_project_bn", "inbound_nodes": [[["block2d_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2d_add", "trainable": false, "dtype": "float32"}, "name": "block2d_add", "inbound_nodes": [[["block2d_project_bn", 0, 0, {}], ["block2c_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2e_expand_conv", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2e_expand_conv", "inbound_nodes": [[["block2d_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2e_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2e_expand_bn", "inbound_nodes": [[["block2e_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2e_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2e_expand_activation", "inbound_nodes": [[["block2e_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2e_project_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2e_project_conv", "inbound_nodes": [[["block2e_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2e_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2e_project_bn", "inbound_nodes": [[["block2e_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2e_add", "trainable": false, "dtype": "float32"}, "name": "block2e_add", "inbound_nodes": [[["block2e_project_bn", 0, 0, {}], ["block2d_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2f_expand_conv", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2f_expand_conv", "inbound_nodes": [[["block2e_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2f_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2f_expand_bn", "inbound_nodes": [[["block2f_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2f_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2f_expand_activation", "inbound_nodes": [[["block2f_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2f_project_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2f_project_conv", "inbound_nodes": [[["block2f_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2f_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2f_project_bn", "inbound_nodes": [[["block2f_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2f_add", "trainable": false, "dtype": "float32"}, "name": "block2f_add", "inbound_nodes": [[["block2f_project_bn", 0, 0, {}], ["block2e_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2g_expand_conv", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2g_expand_conv", "inbound_nodes": [[["block2f_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2g_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2g_expand_bn", "inbound_nodes": [[["block2g_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2g_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2g_expand_activation", "inbound_nodes": [[["block2g_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2g_project_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2g_project_conv", "inbound_nodes": [[["block2g_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2g_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2g_project_bn", "inbound_nodes": [[["block2g_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2g_add", "trainable": false, "dtype": "float32"}, "name": "block2g_add", "inbound_nodes": [[["block2g_project_bn", 0, 0, {}], ["block2f_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3a_expand_conv", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3a_expand_conv", "inbound_nodes": [[["block2g_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3a_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3a_expand_bn", "inbound_nodes": [[["block3a_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3a_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3a_expand_activation", "inbound_nodes": [[["block3a_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3a_project_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3a_project_conv", "inbound_nodes": [[["block3a_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3a_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3a_project_bn", "inbound_nodes": [[["block3a_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3b_expand_conv", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3b_expand_conv", "inbound_nodes": [[["block3a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3b_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3b_expand_bn", "inbound_nodes": [[["block3b_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3b_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3b_expand_activation", "inbound_nodes": [[["block3b_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3b_project_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3b_project_conv", "inbound_nodes": [[["block3b_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3b_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3b_project_bn", "inbound_nodes": [[["block3b_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block3b_add", "trainable": false, "dtype": "float32"}, "name": "block3b_add", "inbound_nodes": [[["block3b_project_bn", 0, 0, {}], ["block3a_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3c_expand_conv", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3c_expand_conv", "inbound_nodes": [[["block3b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3c_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3c_expand_bn", "inbound_nodes": [[["block3c_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3c_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3c_expand_activation", "inbound_nodes": [[["block3c_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3c_project_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3c_project_conv", "inbound_nodes": [[["block3c_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3c_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3c_project_bn", "inbound_nodes": [[["block3c_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block3c_add", "trainable": false, "dtype": "float32"}, "name": "block3c_add", "inbound_nodes": [[["block3c_project_bn", 0, 0, {}], ["block3b_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3d_expand_conv", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3d_expand_conv", "inbound_nodes": [[["block3c_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3d_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3d_expand_bn", "inbound_nodes": [[["block3d_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3d_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3d_expand_activation", "inbound_nodes": [[["block3d_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3d_project_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3d_project_conv", "inbound_nodes": [[["block3d_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3d_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3d_project_bn", "inbound_nodes": [[["block3d_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block3d_add", "trainable": false, "dtype": "float32"}, "name": "block3d_add", "inbound_nodes": [[["block3d_project_bn", 0, 0, {}], ["block3c_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3e_expand_conv", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3e_expand_conv", "inbound_nodes": [[["block3d_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3e_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3e_expand_bn", "inbound_nodes": [[["block3e_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3e_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3e_expand_activation", "inbound_nodes": [[["block3e_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3e_project_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3e_project_conv", "inbound_nodes": [[["block3e_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3e_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3e_project_bn", "inbound_nodes": [[["block3e_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block3e_add", "trainable": false, "dtype": "float32"}, "name": "block3e_add", "inbound_nodes": [[["block3e_project_bn", 0, 0, {}], ["block3d_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3f_expand_conv", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3f_expand_conv", "inbound_nodes": [[["block3e_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3f_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3f_expand_bn", "inbound_nodes": [[["block3f_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3f_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3f_expand_activation", "inbound_nodes": [[["block3f_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3f_project_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3f_project_conv", "inbound_nodes": [[["block3f_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3f_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": 